// @strict-types


&НаКлиенте
Процедура СписокРулоновВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Структура = Новый Структура;
	Материал = Элемент.ТекущиеДанные.Материал;
	Структура.Вставить("МатериалОсновы",ПолучитьМатериалОсновы(Материал));
	Структура.Вставить("Рулон",Элемент.ТекущиеДанные.Рулон);
	Структура.Вставить("Ширина",ПолучитьШирину(Материал));
	ОповеститьОВыборе(Структура);
КонецПроцедуры

&НаСервере
Функция ПолучитьМатериалОсновы(Материал)
	Возврат Материал.МатериалОсновы;
КонецФункции	

&НаСервере
Функция ПолучитьШирину(Материал)
	Возврат Материал.Ширина;
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СписокРулонов.Параметры.УстановитьЗначениеПараметра("ДатаДок", Параметры.ДатаДок);
КонецПроцедуры
