
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.ВзаиморасчетыПоЗаказам.Записывать	= Истина;
	Движения.ВзаиморасчетыПоАктам.Записывать 	= Истина;
	Движения.Касса.Записывать 					= Истина;
	
	Если  Заказы.Количество()=0 Тогда 		
		запись = Движения.ВзаиморасчетыПоЗаказам.Добавить();
		запись.ВидДвижения 	= ВидДвиженияНакопления.Расход;
		запись.Период       = Ссылка.Дата;
		запись.Регистратор 	= Ссылка;
		запись.Организация 	= Ссылка.Организация;
		запись.Контрагент	= Ссылка.Контрагент;
		запись.Сумма     	= СуммаДокумента;
		
		// регистр Касса 
		Движение 				= Движения.Касса.Добавить();
		Движение.ВидДвижения    = ВидДвиженияНакопления.Приход;
		Движение.Период 		= Дата;
		Движение.Организация 	= Организация;
		Движение.РасчетныйСчет 	= КассаСчет;
		Движение.ВидПлатежа 	= ВидПлатежа;
		Движение.СтавкаНДС      = Контрагент.СтавкаНДС;
		Движение.Месяц 			= Период;
		Движение.Сумма 			= СуммаДокумента;
		//Если заполнено в шапке
		Если ЗначениеЗаполнено(СтатьяДохода) Тогда 
			Движение.Статья 		= СтатьяДохода;
		КонецЕсли;
		Если ЗначениеЗаполнено(НомерСтатьиПрихода) Тогда 
			Движение.НомерСтатьи 	= НомерСтатьиПрихода;
		КонецЕсли;		

	иначе	
		для Каждого стрТЧ из Заказы цикл
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ВзаиморасчетыОстатки.СуммаОстаток
			|ИЗ
			|	РегистрНакопления.ВзаиморасчетыПоЗаказам.Остатки(&НаДату, КодЗаказа = &КодЗаказа) КАК ВзаиморасчетыОстатки";
			
			Запрос.УстановитьПараметр("КодЗаказа", стрТЧ.КодЗаказа);
			Запрос.УстановитьПараметр("НаДату", Ссылка.Дата-1);
			
			Результат = Запрос.Выполнить();
			
			ВыборкаДетальныеЗаписи = Результат.Выбрать();
			СуммаОстаток = 0;
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				СуммаОстаток = ВыборкаДетальныеЗаписи.СуммаОстаток;
			КонецЦикла;
			
			Если СуммаОстаток=0 Тогда 
				Сообщить("По заказу "+стрТЧ.КодЗаказа+" равно: "+СуммаОстаток);
				//Отказ = Истина;
			КонецЕсли;	
			
			Если НЕ ЗначениеЗаполнено(Организация) Тогда
				
				Запрос = Новый Запрос;
				Запрос.Текст = 
				"ВЫБРАТЬ
				|	Заявка.Организация
				|ИЗ
				|	Документ.Заявка КАК Заявка
				|ГДЕ
				|	Заявка.Номер = &КодЗаказа";
				
				Запрос.УстановитьПараметр("КодЗаказа", стрТЧ.КодЗаказа);
				
				РезультатЗапроса = Запрос.Выполнить();
				
				ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
				
				Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
					Организация = ВыборкаДетальныеЗаписи.Организация;
				КонецЦикла;
				
				Записать();
			КонецЕсли;
			
			запись = Движения.ВзаиморасчетыПоЗаказам.Добавить();
			запись.ВидДвижения 	= ВидДвиженияНакопления.Расход;
			запись.Период       = Ссылка.Дата;
			запись.Организация  = Ссылка.Организация;
			запись.Регистратор 	= Ссылка;
			запись.Контрагент	= Ссылка.Контрагент;
			запись.КодЗаказа 	= стрТЧ.КодЗаказа;
			запись.Сумма     	= стрТЧ.Сумма;
			
			запись = Движения.ВзаиморасчетыПоАктам.Добавить();
			запись.ВидДвижения 	= ВидДвиженияНакопления.Расход;
			запись.Период       = Ссылка.Дата;
			запись.Организация  = Ссылка.Организация;
			запись.Регистратор 	= Ссылка;
			запись.Контрагент	= Ссылка.Контрагент;
			запись.КодЗаказа 	= стрТЧ.КодЗаказа;
			запись.Сумма     	= стрТЧ.Сумма;
			
			
			// регистр Касса 
			Движение 				= Движения.Касса.Добавить();
			Движение.ВидДвижения    = ВидДвиженияНакопления.Приход;
			Движение.Период 		= Дата;
			Движение.Организация 	= Организация;
			Движение.РасчетныйСчет 	= КассаСчет;
			Движение.ВидПлатежа 	= ВидПлатежа;
			Движение.СтавкаНДС      = Контрагент.СтавкаНДС;
			Движение.Месяц 			= Период;
			Движение.Статья 		= стрТЧ.СтатьяДохода;
			Движение.НомерСтатьи 	= стрТЧ.НомерСтатьиПрихода;
			Движение.КодЗаказа      = стрТЧ.КодЗаказа;
			Движение.Сумма 			= стрТЧ.Сумма;

		КонецЦикла;
	КонецЕсли;
	
	Движения.Записать();
	
КонецПроцедуры
