// @strict-types


&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	ЗаполнитьБанковскийСчет();
КонецПроцедуры

 &НаСервере
Процедура ЗаполнитьБанковскийСчет()
	Объект.БанковскийСчет = Объект.Организация.БанковскийСчет; 
КонецПроцедуры	 

&НаКлиенте
Процедура ТоварыКодЗаказаОткрытие(Элемент, СтандартнаяОбработка)
	//Временно?
	//Если Объект.Проведен Тогда 
	//	СтандартнаяОбработка = Ложь;
	//КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКодЗаказаПриИзменении(Элемент)
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	ЗаполнитьПоЗаказу(ТекущиеДанные.НомерСтроки-1);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоЗаказу(НомерСтроки) 
	текСтрока = Объект.Товары[НомерСтроки];
	Если ТипЗнч(текСтрока.КодЗаказа) = Тип("ДокументСсылка.Заявка") Тогда 		
		текСтрока.Номенклатура = текСтрока.КодЗаказа.ИнформацияВСчете;
		текСтрока.Количество   =1;
		текСтрока.Всего        = текСтрока.КодЗаказа.ИтогоЗаВесьЗаказ; 
		текСтрока.НДС 			= Объект.Организация.СтавкаНДС;
		Если текСтрока.НДС = Перечисления.СтавкиНДС.НДС20 Тогда 
			текСтрока.СуммаНДС      = текСтрока.КодЗаказа.ИтогоЗаВесьЗаказ*20/120;		
		иначе
			текСтрока.СуммаНДС      = 0;
		КонецЕсли;
		текСтрока.Цена         = текСтрока.КодЗаказа.ИтогоЗаВесьЗаказ-текСтрока.СуммаНДС;
		текСтрока.Сумма        = текСтрока.КодЗаказа.ИтогоЗаВесьЗаказ-текСтрока.СуммаНДС;
	ИначеЕсли ТипЗнч(текСтрока.КодЗаказа) = Тип("ДокументСсылка.КартаЗаказа") Тогда 
		ЗаполнитьЗначенияСвойств(текСтрока,текСтрока.КодЗаказа);	
	КонецЕсли;
КонецПроцедуры	

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	Расчитать();
КонецПроцедуры

&НаКлиенте
Процедура Расчитать()
	ТекущиеДанные =  Элементы.Товары.ТекущиеДанные;
	ТекущиеДанные.Сумма = ТекущиеДанные.Цена*ТекущиеДанные.Количество;
	Если Строка(ТекущиеДанные.НДС) = "Без НДС" Тогда
		ТекущиеДанные.СуммаНДС = 0;
	иначеЕсли Строка(ТекущиеДанные.НДС) = "18%" Тогда
		Если Объект.НДС_В_томЧисле Тогда
			ТекущиеДанные.СуммаНДС = ТекущиеДанные.Сумма/118*18;
		иначе	
			ТекущиеДанные.СуммаНДС = ТекущиеДанные.Сумма*0.18;
		КонецЕсли;
	иначеЕсли Строка(ТекущиеДанные.НДС) = "20%" Тогда
		Если Объект.НДС_В_томЧисле Тогда
			ТекущиеДанные.СуммаНДС = ТекущиеДанные.Сумма/120*20;
		иначе	
			ТекущиеДанные.СуммаНДС = ТекущиеДанные.Сумма*0.2;
		КонецЕсли;
	КонецЕсли;
	Если Объект.НДС_В_томЧисле Тогда
		ТекущиеДанные.Всего	= ТекущиеДанные.Сумма;
	иначе	
		ТекущиеДанные.Всего	= ТекущиеДанные.Сумма+ТекущиеДанные.СуммаНДС;
	КонецЕсли;
	ВсегоНДС 				= Объект.Товары.Итог("СуммаНДС");
	Объект.СуммаДокумента 	= Объект.Товары.Итог("Всего");
КонецПроцедуры	

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	Расчитать();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыНДСПриИзменении(Элемент)
	Расчитать();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Не Параметры.Ключ.Пустая() Тогда 
		ВсегоНДС = Объект.Товары.Итог("СуммаНДС");
		Если  Не Объект.СуммаДокумента = Объект.Товары.Итог("Всего") Тогда 
			Объект.СуммаДокумента = Объект.Товары.Итог("Всего");
		КонецЕсли;
		Если Не ЗначениеЗаполнено(Объект.Акт) Тогда 
			
			//Найдем акт	
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	Акт.Ссылка
			|ИЗ
			|	Документ.Акт КАК Акт
			|ГДЕ
			|	Акт.Основание = &Основание";
			
			Запрос.УстановитьПараметр("Основание",Объект.Ссылка);
			
			Выборка = Запрос.Выполнить().Выбрать();
			Пока Выборка.Следующий() Цикл 
				Объект.Акт =  Выборка.Ссылка;
				Модифицированность = Истина;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	текСтрока = Элементы.Товары.ТекущиеДанные;
	СодержаниеНоменклатуры = ПолучитьСодержаниеНоменклатуры(текСтрока.Номенклатура); //13.08.20
	Если ЗначениеЗаполнено(СодержаниеНоменклатуры) Тогда 
		текСтрока.Содержание = СодержаниеНоменклатуры;	
	иначе
		текСтрока.Содержание = ПолучитьНаименованиеНоменклатуры(текСтрока.Номенклатура);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПолучитьСодержаниеНоменклатуры(Номенклатура)
	Возврат Номенклатура.Содержание;
КонецФункции	

&НаСервере
Функция ПолучитьНаименованиеНоменклатуры(Номенклатура)
	Возврат Номенклатура.Наименование;
КонецФункции	

&НаКлиенте
Процедура ТоварыВсегоПриИзменении(Элемент)
	ТекущиеДанные =  Элементы.Товары.ТекущиеДанные;
	Если ТекущиеДанные.СуммаНДС>0 Тогда 
		Если НЕ ТекущиеДанные.Всего = ТекущиеДанные.Сумма+ТекущиеДанные.СуммаНДС Тогда 
			Сообщить("В строке:"+ТекущиеДанные.НомерСтроки+" (Сумма+Сумма НДС) не равна (Всего)"
			+Символы.ПС+"Для документа с НДС, не должно быть так");
			ТекущиеДанные.Всего = ТекущиеДанные.Сумма+ТекущиеДанные.СуммаНДС;
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры

