// @strict-types


&НаКлиенте
Процедура СоздатьДокумент(Команда)
	
	СтруктураПараметров = новый Структура;	
	СтруктураПараметров.Вставить("ВыборкаПлотернаяРезка",Ложь);
	СтруктураПараметров.Вставить("МонтажкаПлотернаяРезка",Ложь);
	СтруктураПараметров.Вставить("ПодВидыРабот","");
	СтруктураПараметров.Вставить("ВидыРабот","");
	
	Если Печать Тогда 
		СтруктураПараметров.Вставить("ВидыРабот","СобственнаяПечать");
	ИначеЕсли Изготовление Тогда 
		СтруктураПараметров.Вставить("ВидыРабот","Изготовление");
		Если Сборка Тогда  
			СтруктураПараметров.Вставить("ПодВидыРабот","Сборка");
		ИначеЕсли ПлотернаяРезка Тогда  
			СтруктураПараметров.Вставить("ПодВидыРабот","ПлотернаяРезка");	
			Если Выборка Тогда  
				СтруктураПараметров.Вставить("ВыборкаПлотернаяРезка",Истина);
			КонецЕсли;
			Если Монтажка Тогда 
				СтруктураПараметров.Вставить("МонтажкаПлотернаяРезка",Истина);
			КонецЕсли;
		ИначеЕсли Ламинация Тогда  
			СтруктураПараметров.Вставить("ПодВидыРабот","Ламинация");
		ИначеЕсли Окраска Тогда  
			СтруктураПараметров.Вставить("ПодВидыРабот","Окраска");	
		ИначеЕсли Резка Тогда  
			СтруктураПараметров.Вставить("ПодВидыРабот","Резка");			
		КонецЕсли;	
	ИначеЕсли Монтаж Тогда 
		СтруктураПараметров.Вставить("ВидыРабот","Монтаж");
	ИначеЕсли Дизайн Тогда   //доб. 15.01.20
		СтруктураПараметров.Вставить("ВидыРабот","Дизайн");	
	ИначеЕсли Доставка Тогда 
		СтруктураПараметров.Вставить("ВидыРабот","Доставка");
	ИначеЕсли ПродажаМатериаловЗаказчику Тогда 
		СтруктураПараметров.Вставить("ВидыРабот","Продажа");
	ИначеЕсли Накатка Тогда 
		СтруктураПараметров.Вставить("ВидыРабот","Накатка");	
	КонецЕсли;	
	
	ОткрытьФорму("Документ.Заявка.ФормаОбъекта",СтруктураПараметров);
	ЭтаФорма.Закрыть();

КонецПроцедуры

&НаКлиенте
Процедура ПродажаМатериаловСотрудникуПриИзменении(Элемент)
	ПродажаМатериаловЗаказчику = Не ПродажаМатериаловСотруднику;
КонецПроцедуры

&НаКлиенте
Процедура ПечатьПриИзменении(Элемент)
	Если Печать Тогда 
		Изготовление= Ложь;
		Монтаж 		= Ложь;
		Доставка 	= Ложь;
		Дизайн		= Ложь;
		Накатка     = Ложь;
		ПродажаМатериаловЗаказчику = Ложь;
	КонецЕсли;
	Элементы.Изготовление.Видимость = Не Печать;
	Элементы.Монтаж.Видимость 		= Не Печать;
	Элементы.Доставка.Видимость 	= Не Печать;
	Элементы.Дизайн.Видимость 		= Не Печать;
	Элементы.Накатка.Видимость 		= Не Печать;
	Элементы.ПродажаМатериаловЗаказчику.Видимость = Не Печать;
	Элементы.ГруппаИзготовления.Видимость = Изготовление;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Элементы.ГруппаИзготовления.Видимость 	= Изготовление;
	Элементы.ГруппаПлотернаяРезка.Видимость = ПлотернаяРезка;
КонецПроцедуры

&НаКлиенте
Процедура ИзготовлениеПриИзменении(Элемент)
	Если Изготовление Тогда 
		Печать		= Ложь;
		Монтаж 		= Ложь;
		Доставка 	= Ложь;
		Дизайн	 	= Ложь;
		Накатка     = Ложь;
		ПродажаМатериаловЗаказчику = Ложь;
	КонецЕсли;
	Элементы.Печать.Видимость 				= Не Изготовление;
	Элементы.Монтаж.Видимость 				= Не Изготовление;
	Элементы.Доставка.Видимость 			= Не Изготовление;
	Элементы.Накатка.Видимость 				= Не Изготовление;
	Элементы.Дизайн.Видимость 				= Не Изготовление;
	Элементы.ПродажаМатериаловЗаказчику.Видимость = Не Изготовление;
	Элементы.ГруппаИзготовления.Видимость 	= Изготовление;
	Элементы.ГруппаПлотернаяРезка.Видимость = ПлотернаяРезка и Изготовление;
КонецПроцедуры

&НаКлиенте
Процедура СборкаПриИзменении(Элемент)
	Элементы.ПлотернаяРезка.Видимость 		= Не Сборка;
	Элементы.Ламинация.Видимость 			= Не Сборка;
	Элементы.Окраска.Видимость 				= Не Сборка;
	Элементы.Резка.Видимость 				= Не Сборка;
	Элементы.ГруппаПлотернаяРезка.Видимость = ПлотернаяРезка;
КонецПроцедуры

&НаКлиенте
Процедура ПлотернаяРезкаПриИзменении(Элемент)
	Элементы.Сборка.Видимость 				= Не ПлотернаяРезка;
	Элементы.Ламинация.Видимость 			= Не ПлотернаяРезка;
	Элементы.ГруппаПлотернаяРезка.Видимость = ПлотернаяРезка;
	Элементы.Окраска.Видимость 				= Не ПлотернаяРезка;
	Элементы.Резка.Видимость 				= Не ПлотернаяРезка;
КонецПроцедуры

&НаКлиенте
Процедура ВыборкаПриИзменении(Элемент)
	
КонецПроцедуры

&НаКлиенте
Процедура ЛаминацияПриИзменении(Элемент)
	Элементы.Сборка.Видимость 			= Не Ламинация;
	Элементы.ПлотернаяРезка.Видимость 	= Не Ламинация;
	Элементы.Выборка.Видимость 			= Не Ламинация;
	Элементы.Монтажка.Видимость 		= Не Ламинация;
	Элементы.Окраска.Видимость 			= Не Ламинация;
	Элементы.Резка.Видимость 			= Не Ламинация;
КонецПроцедуры

&НаКлиенте
Процедура МонтажкаПриИзменении(Элемент)
	
КонецПроцедуры

&НаКлиенте
Процедура ОкраскаПриИзменении(Элемент)
	Элементы.Сборка.Видимость 			= Не Окраска;
	Элементы.ПлотернаяРезка.Видимость 	= Не Окраска;
	Элементы.Выборка.Видимость 			= Не Окраска;
	Элементы.Ламинация.Видимость 		= Не Окраска;
	Элементы.Монтажка.Видимость 		= Не Окраска;
	Элементы.Резка.Видимость 			= Не Окраска;
КонецПроцедуры

&НаКлиенте
Процедура РезкаПриИзменении(Элемент)
	Элементы.Сборка.Видимость 			= Не Резка;
	Элементы.ПлотернаяРезка.Видимость 	= Не Резка;
	Элементы.Выборка.Видимость 			= Не Резка;
	Элементы.Ламинация.Видимость 		= Не Резка;
	Элементы.Монтажка.Видимость 		= Не Резка;
	Элементы.Окраска.Видимость 			= Не Резка;
КонецПроцедуры

&НаКлиенте
Процедура МонтажПриИзменении(Элемент)
	Если Монтаж Тогда 
		Изготовление= Ложь;
		Печать 		= Ложь;
		Доставка 	= Ложь;
		Дизайн	 	= Ложь;
		Накатка     = Ложь;
		ПродажаМатериаловЗаказчику = Ложь;
	КонецЕсли;
	Элементы.Изготовление.Видимость = Не Монтаж;
	Элементы.Доставка.Видимость 	= Не Монтаж;
	Элементы.Печать.Видимость 		= Не Монтаж;
	Элементы.Дизайн.Видимость 		= Не Монтаж;
	Элементы.Накатка.Видимость 		= Не Монтаж;
	Элементы.ПродажаМатериаловЗаказчику.Видимость = Не Монтаж;
	Элементы.ГруппаИзготовления.Видимость = Изготовление;
КонецПроцедуры

&НаКлиенте
Процедура ДоставкаПриИзменении(Элемент)
	Если Доставка Тогда 
		Изготовление= Ложь;
		Дизайн      = Ложь;
		Печать 		= Ложь;
		Монтаж 		= Ложь;
		Накатка     = Ложь;
		ПродажаМатериаловЗаказчику = Ложь;
	КонецЕсли;
	Элементы.Изготовление.Видимость = Не Доставка;
	Элементы.Дизайн.Видимость 		= Не Доставка;
	Элементы.Монтаж.Видимость 		= Не Доставка;
	Элементы.Печать.Видимость 		= Не Доставка;
	Элементы.Накатка.Видимость 		= Не Доставка;
	Элементы.ПродажаМатериаловЗаказчику.Видимость = Не Доставка;
	Элементы.ГруппаИзготовления.Видимость = Изготовление;
КонецПроцедуры

&НаКлиенте
Процедура ПродажаМатериаловЗаказчикуПриИзменении(Элемент)
	Если ПродажаМатериаловЗаказчику Тогда 
		Изготовление= Ложь;
		Печать 		= Ложь;
		Дизайн      = Ложь;
		Монтаж 		= Ложь;
		Доставка    = Ложь;
		Накатка     = Ложь;
	КонецЕсли;
	Элементы.Изготовление.Видимость = Не ПродажаМатериаловЗаказчику;
	Элементы.Монтаж.Видимость 		= Не ПродажаМатериаловЗаказчику;
	Элементы.Печать.Видимость 		= Не ПродажаМатериаловЗаказчику;
	Элементы.Доставка.Видимость 	= Не ПродажаМатериаловЗаказчику;
	Элементы.Дизайн.Видимость 		= Не ПродажаМатериаловЗаказчику;
	Элементы.Накатка.Видимость 		= Не ПродажаМатериаловЗаказчику;
	Элементы.ГруппаИзготовления.Видимость = Изготовление;
КонецПроцедуры

&НаКлиенте
Процедура НакаткаПриИзменении(Элемент)
	Если Накатка Тогда 
		Изготовление= Ложь;
		Дизайн      = Ложь;
		Печать 		= Ложь;
		Монтаж 		= Ложь;
		Доставка    = Ложь;
		ПродажаМатериаловЗаказчику =Ложь;
	КонецЕсли;
	Элементы.Изготовление.Видимость = Не Накатка;
	Элементы.Монтаж.Видимость 		= Не Накатка;
	Элементы.Печать.Видимость 		= Не Накатка;
	Элементы.Доставка.Видимость 	= Не Накатка;
	Элементы.Дизайн.Видимость 		= Не Накатка;
	Элементы.ПродажаМатериаловЗаказчику.Видимость 	= Не Накатка;
	Элементы.ГруппаИзготовления.Видимость = Изготовление;	
КонецПроцедуры

//доб. 15.01.20
&НаКлиенте
Процедура ДизайнПриИзменении(Элемент)
	Если Дизайн Тогда 
		Изготовление= Ложь;
		Накатка     = Ложь;
		Печать 		= Ложь;
		Монтаж 		= Ложь;
		Доставка    = Ложь;
		ПродажаМатериаловЗаказчику =Ложь;
	КонецЕсли;
	Элементы.Изготовление.Видимость = Не Дизайн;
	Элементы.Монтаж.Видимость 		= Не Дизайн;
	Элементы.Печать.Видимость 		= Не Дизайн;
	Элементы.Доставка.Видимость 	= Не Дизайн;
	Элементы.Накатка.Видимость 		= Не Дизайн;
	Элементы.ПродажаМатериаловЗаказчику.Видимость 	= Не Дизайн;
	Элементы.ГруппаИзготовления.Видимость = Изготовление;	
КонецПроцедуры

