// @strict-types


&НаКлиенте
Процедура Заполнить(Команда)
   ЗаполнитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РулоныОстатки.Материал,
		|	РулоныОстатки.Рулон,
		|	РулоныОстатки.КоличествоОстаток КАК ОстатокПоДокументу,
		|	РулоныОстатки.Материал.Поставщик КАК Поставщик,
		|	РулоныОстатки.Материал.Ширина КАК Ширина,
		|	ЦеныРулоновСрезПоследних.Цена,
		|	РулоныОстатки.МатериалОсновы КАК МатериалОсновы
		|ИЗ
		|	РегистрНакопления.Рулоны.Остатки(&НаДату, ) КАК РулоныОстатки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныРулонов.СрезПоследних КАК ЦеныРулоновСрезПоследних
		|		ПО РулоныОстатки.Рулон = ЦеныРулоновСрезПоследних.Рулон";

	Запрос.УстановитьПараметр("НаДату",Объект.Дата);

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();
    Объект.Материалы.Загрузить(Результат.Выгрузить());
	
КонецПроцедуры	

&НаКлиенте
Процедура МатериалыПриИзменении(Элемент)
	текщиеДанные = Элементы.Материалы.ТекущиеДанные;
	текщиеДанные.разница = текщиеДанные.ОстатокПоДокументу-текщиеДанные.ОстатокФакт; 
КонецПроцедуры

&НаКлиенте
Процедура ВизаНППриИзменении(Элемент)
	ЗаполнитьДатуВизыНП();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДатуВизыНП()
  	Объект.ДатаВизыНП = ТекущаяДата();
	Элементы.ВизаНП.Доступность = Ложь;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если не РольДоступна("Полныеправа")Тогда 
		Элементы.ВизаНП.Доступность = Не ЗначениеЗаполнено(Объект.ДатаВизыНП);
		Элементы.ВизаУУ.Доступность = Не ЗначениеЗаполнено(Объект.ДатаВизыУУ);
		Если  Объект.ВизаУУ и Объект.ВизаНП Тогда 
			ЭтаФорма.ТолькоПросмотр =  Истина;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВизаУУПриИзменении(Элемент)
	ЗаполнитьДатуВизыУУ();	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДатуВизыУУ()
  	Объект.ДатаВизыУУ = ТекущаяДата();
	Элементы.ВизаУУ.Доступность = Ложь;
КонецПроцедуры

