
&НаКлиенте
Процедура Сформировать(Команда)
	
    СформироватьОтчетНаСервере();

КонецПроцедуры

&НаСервере
Процедура СформироватьОтчетНаСервере()
	
	ТабДокумент.Очистить();
	
	Макет =РеквизитФормыВЗначение("Отчет").ПолучитьМакет("Макет1");
	
	 	мТекстЗаголовка = Символ(13)+ "взаимных расчетов по состоянию " + Формат(Период.ДатаОкончания, "ДЛФ=Д") + " между " +
							Организация.Наименование + " и " + Контрагент.НаименованиеПолное;
		мТекстЗаголовка = мТекстЗаголовка + Символ(13) + Символ(13) + Символ(13) + Символ(13);
		мТекстИнформации = "Мы, нижеподписавшиеся _____________________ " + Организация.Наименование + 
							" _____________________ , с одной стороны, и _____________________ " + 
							Контрагент.НаименованиеПолное + " _____________________ , с другой стороны, " +
							"составили настоящий акт сверки в том, состояние взаимных расчетов по данным учета следующее:" + Символ(13) + Символ(13);
		мПоДаннымОрганизации= "По данным " + Организация.Наименование;
		мОтОрганизации 		= "От " + Организация.Наименование;
		
	Шапка = Макет.ПолучитьОбласть("Шапка");

	Шапка.Параметры.ТекстЗаголовка 	= мТекстЗаголовка;
	Шапка.Параметры.ТекстИнформации = мТекстИнформации;
	ТабДокумент.Вывести(Шапка);

	ШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ТабДокумент.Вывести(ШапкаТаблицы);

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВзаиморасчетыОстатки.СуммаОстаток КАК СуммаОстаток
		|ИЗ
		|	РегистрНакопления.ВзаиморасчетыПоЗаказам.Остатки(&НачДата, Контрагент = &Контрагент) КАК ВзаиморасчетыОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВзаиморасчетыОбороты.Регистратор.Дата КАК РегистраторДата,
		|	ВзаиморасчетыОбороты.Регистратор.Номер КАК РегистраторНомер,
		|	ВЫБОР
		|		КОГДА ВзаиморасчетыОбороты.Регистратор ССЫЛКА Документ.Заявка
		|			ТОГДА ""Продажа""
		|		ИНАЧЕ ""Оплата""
		|	КОНЕЦ КАК ВидОперации,
		|	ВЫБОР
		|		КОГДА ВзаиморасчетыОбороты.Регистратор ССЫЛКА Документ.Заявка
		|			ТОГДА ВзаиморасчетыОбороты.Регистратор.ИтогоЗаВесьЗаказ
		|		ИНАЧЕ ВзаиморасчетыОбороты.Регистратор.СуммаДокумента
		|	КОНЕЦ КАК Сумма,
		|	ВЫБОР
		|		КОГДА ВзаиморасчетыОбороты.Регистратор ССЫЛКА Документ.Заявка
		|			ТОГДА ВзаиморасчетыОбороты.Регистратор.НаименованиеЗаказа
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК Описание
		|ИЗ
		|	РегистрНакопления.ВзаиморасчетыПоЗаказам.Обороты(&НачДата, &КонДата, Регистратор, Контрагент = &Контрагент) КАК ВзаиморасчетыОбороты
		|
		|УПОРЯДОЧИТЬ ПО
		|	РегистраторДата
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВзаиморасчетыОстатки.СуммаОстаток КАК СуммаОстаток
		|ИЗ
		|	РегистрНакопления.ВзаиморасчетыПоЗаказам.Остатки(&КонДата, Контрагент = &Контрагент) КАК ВзаиморасчетыОстатки";
		
		Запрос.УстановитьПараметр("НачДата",Период.ДатаНачала);
		Запрос.УстановитьПараметр("КонДата",КонецДня(Период.ДатаОкончания));
		Запрос.УстановитьПараметр("Контрагент",Контрагент);
		
		масРезультатов = Запрос.ВыполнитьПакет();
		
		//Сальдо Начальное
		ВыборкаДетальныеЗаписи = масРезультатов[0].Выбрать();
		СальдоНачальное = Макет.ПолучитьОбласть("СальдоНачальное");
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл		
			СальдоНачальное.Параметры.СальдоНачТекст = "Сальдо на " + Формат(Период.ДатаНачала, "ДЛФ=Д");
			СальдоНачальное.Параметры.СальдоНач = ВыборкаДетальныеЗаписи.СуммаОстаток;
			ТабДокумент.Вывести(СальдоНачальное);
		КонецЦикла;
		
		всегоДт = 0;
		всегоКт = 0;
		
		ВыборкаДетальныеЗаписи = масРезультатов[1].Выбрать();
		Обороты = Макет.ПолучитьОбласть("Обороты");
		НомерС = 1;
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Обороты.Параметры.НомерС = НомерС;
			Обороты.Параметры.ВидОперации	= ВыборкаДетальныеЗаписи.ВидОперации;
			Обороты.Параметры.ДатаОперации 	= Формат(ВыборкаДетальныеЗаписи.РегистраторДата, "ДЛФ=Д");
			Обороты.Параметры.Номер 		= ВыборкаДетальныеЗаписи.РегистраторНомер;
			Обороты.Параметры.Описание 		= ВыборкаДетальныеЗаписи.Описание;
			Если ВыборкаДетальныеЗаписи.ВидОперации="Продажа" Тогда 
				Обороты.Параметры.Дебет 		= ВыборкаДетальныеЗаписи.Сумма; 
				Обороты.Параметры.Кредит 		= "";
				всегоДт = всегоДт+ ВыборкаДетальныеЗаписи.Сумма;
			иначе
				Обороты.Параметры.Кредит 		= ВыборкаДетальныеЗаписи.Сумма;
				Обороты.Параметры.Дебет 		= "";
				всегоКт = всегоКт+ ВыборкаДетальныеЗаписи.Сумма;
			КонецЕсли;
			ТабДокумент.Вывести(Обороты);
			НомерС = НомерС+1;
		КонецЦикла;

		ОбИтог = Макет.ПолучитьОбласть("ОборотыИтог");
        ОбИтог.Параметры.ОборотД = всегоДт;
        ОбИтог.Параметры.ОборотК = всегоКт;
		ТабДокумент.Вывести(ОбИтог);

		ВыборкаДетальныеЗаписи = масРезультатов[2].Выбрать();
		СальдоКонечное = Макет.ПолучитьОбласть("СальдоКонечное");
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл		
			СальдоКонечное.Параметры.СальдоКонТекст = "Сальдо на " + Формат(Период.ДатаНачала, "ДЛФ=Д");
			Если ВыборкаДетальныеЗаписи.СуммаОстаток>0 Тогда 
				СальдоКонечное.Параметры.СальдоКон = ВыборкаДетальныеЗаписи.СуммаОстаток;
				впользу =  Организация.Наименование;
			иначе
				СальдоКонечное.Параметры.СальдоКон2 = -ВыборкаДетальныеЗаписи.СуммаОстаток;
				впользу = Контрагент.НаименованиеПолное;
			КонецЕсли;
			ТабДокумент.Вывести(СальдоКонечное);
		КонецЦикла;
		
		облПодвал = Макет.ПолучитьОбласть("Подвал");
		
		ФормСтрока = "Л = ru_RU; ДП = Истина";
		ПарПредмета="рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 2";
		ПрописьЧисла = ЧислоПрописью(ВыборкаДетальныеЗаписи.СуммаОстаток, ФормСтрока, ПарПредмета);	
		
		облПодвал.Параметры.ПоДаннымОрганизации = "По данным "+Организация.Наименование;
		
		облПодвал.Параметры.РезультатыСверки = "на "+Формат(Период.ДатаНачала, "ДЛФ=Д")+" задолженность в пользу "+впользу
		+" "+ВыборкаДетальныеЗаписи.СуммаОстаток+" ("+ПрописьЧисла+")";
		
		облПодвал.Параметры.ОтОрганизацииСтрока  = "от "+Организация.Наименование;
	    облПодвал.Параметры.ОтЗаказчикаСтрока  = "от "+Контрагент.НаименованиеПолное;

		ТабДокумент.Вывести(облПодвал);

	
КонецПроцедуры
