// @strict-types


&НаКлиенте
Процедура НачисленоСотрудникПриИзменении(Элемент)
	ТекущиеДанные 			= Элементы.Начислено.ТекущиеДанные;
	текущиеДанные.Должность = ПолучитьДолжность(ТекущиеДанные.Сотрудник);
	//Если ЗначениеЗаполнено(текущиеДанные.Оклад) Тогда
	//	Режим = РежимДиалогаВопрос.ДаНет;
	//	Ответ = Вопрос("Изменить оклад?", Режим, 0);
	//	Если Ответ = КодВозвратаДиалога.Да Тогда
	//		текущиеДанные.Оклад     = ПолучитьОклад(ТекущиеДанные.Сотрудник);
	//	КонецЕсли;
	//иначе
	//	текущиеДанные.Оклад     = ПолучитьОклад(ТекущиеДанные.Сотрудник);	
	//КонецЕсли;	
КонецПроцедуры

&НаСервере
Функция ПолучитьДолжность(Сотрудник)
	Должность 	=  Сотрудник.Должность;
	Возврат Должность;
КонецФункции

&НаСервере
Функция ПолучитьОклад(Сотрудник)
	Оклад 	=  Сотрудник.Должность.Оклад;
	Возврат Оклад;
КонецФункции

&НаСервере
Функция ПолучитьВидНачисления(НачислениеУдержание)
	Если НачислениеУдержание.НачислениеУдержание = Перечисления.НачисленияУдержания.Удержание Тогда 
		Возврат "Удержание";
	иначеЕсли НачислениеУдержание.НачислениеУдержание = Перечисления.НачисленияУдержания.Начисление Тогда 
		Возврат "Начисление";
	КонецЕсли;	
КонецФункции	

&НаКлиенте
Процедура НачисленоНачислениеУдержаниеПриИзменении(Элемент)
	ТекущиеДанные 			= Элементы.Начислено.ТекущиеДанные;	
	ВидыПоказателя = ПолучитьВидыПоказателя(ТекущиеДанные.НачислениеУдержание);
	Если ЗначениеЗаполнено(ТекущиеДанные.СуммаНачислено) Тогда
		//Режим = РежимДиалогаВопрос.ДаНет;
		//Ответ = Вопрос("Изменить оклад?", Режим, 0);
		//Если Ответ = КодВозвратаДиалога.Нет Тогда
		//	Возврат;
		//КонецЕсли;
	КонецЕсли;
	
	Если ВидыПоказателя = "Сумма" Тогда 
		ТекущиеДанные.СуммаНачислено = ПолучитьЗначениеНачислениеУдержание(ТекущиеДанные.НачислениеУдержание);
	ИначеЕсли ВидыПоказателя = "Процент" Тогда  
		ТекущиеДанные.СуммаНачислено = Окр(ТекущиеДанные.Оклад*(ПолучитьЗначениеНачислениеУдержание(ТекущиеДанные.НачислениеУдержание)/100),0);
	КонецЕсли;
		
	Если ПолучитьВидНачислениеУдержание(ТекущиеДанные.НачислениеУдержание) = "Удержание" Тогда
		Если ТекущиеДанные.СуммаНачислено>0 Тогда 
		 ТекущиеДанные.СуммаНачислено = - ТекущиеДанные.СуммаНачислено;
		КонецЕсли;
	 КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура НачисленоОкладПриИзменении(Элемент)
	ТекущиеДанные 			= Элементы.Начислено.ТекущиеДанные;	
	ВидыПоказателя = ПолучитьВидыПоказателя(ТекущиеДанные.НачислениеУдержание);
	Если ЗначениеЗаполнено(ТекущиеДанные.СуммаНачислено) Тогда
		//Режим = РежимДиалогаВопрос.ДаНет;
		//Ответ = Вопрос("Изменить оклад?", Режим, 0);
		//Если Ответ = КодВозвратаДиалога.Нет Тогда
		//	Возврат;
		//КонецЕсли;
	КонецЕсли;
	
	Если ВидыПоказателя = "Сумма" Тогда 
		ТекущиеДанные.СуммаНачислено = ПолучитьЗначениеНачислениеУдержание(ТекущиеДанные.НачислениеУдержание);
	ИначеЕсли ВидыПоказателя = "Процент" Тогда  
		ТекущиеДанные.СуммаНачислено = Окр(ТекущиеДанные.Оклад*(ПолучитьЗначениеНачислениеУдержание(ТекущиеДанные.НачислениеУдержание)/100),0);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ПолучитьВидыПоказателя(Начисление)
	ВидыПоказателя 	=  Строка(Начисление.ВидыПоказателя);
	Возврат ВидыПоказателя;
КонецФункции

&НаСервере
Функция ПолучитьВидНачислениеУдержание(Начисление)
	Вид 	=  Строка(Начисление.НачислениеУдержание);
	Возврат Вид;
КонецФункции

&НаСервере
Функция ПолучитьЗначениеНачислениеУдержание(Начисление)
	Значение 	=  Начисление.Значение;
	Возврат Значение;
КонецФункции

&НаКлиенте
Процедура НачисленоПриИзменении(Элемент)
	ТекущиеДанные 			= Элементы.Начислено.ТекущиеДанные;	
	Вид = ПолучитьВидНачисления(ТекущиеДанные.НачислениеУдержание);
	Если вид = "Удержание" Тогда
		Если ТекущиеДанные.СуммаНачислено>0 Тогда 
			ТекущиеДанные.СуммаНачислено = -(ТекущиеДанные.СуммаНачислено);
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры



