
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Объект.СтатусЗадачи = Перечисления.СтатусыЗадач.Закрыта Тогда 
		Если РольДоступна("ПолныеПрава")=Ложь Тогда   
			ЭтаФорма.ТолькоПросмотр = Истина;
		Иначе 
			ЭтаФорма.ТолькоПросмотр = Ложь;
		КонецЕсли;	
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Объект.Автор) Тогда 
		Объект.Автор 		= ПараметрыСеанса.ТекущийПользователь;
		Объект.Проверяющий 	= ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
	Если Параметры.Ключ.Пустая() Тогда 
		 Объект.СтатусЗадачи = Перечисления.СтатусыЗадач.НадоСделать;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура Добавить(Команда)
	новСтрока = Объект.Выполнение.Добавить();
	новСтрока.Дата = ТекущаяДата();
	новСтрока.Сотрудник = ПолучитьТекПользователя();
КонецПроцедуры

&НаСервере
Функция ПолучитьТекПользователя()
	 Возврат ОбщегоНазначения.НайтиСотрудникаПоПользователю(ПараметрыСеанса.ТекущийПользователь); 
 КонецФункции	

&НаКлиенте
 Процедура ВыполнениеПередУдалением(Элемент, Отказ)
	 Отказ = Истина;
 КонецПроцедуры

&НаКлиенте
 Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	 Если Объект.Выполнение.Количество()>0 Тогда 
		 Объект.ДатаПоследнегоИзменения = Объект.Выполнение.Получить(Объект.Выполнение.Количество()-1).Дата;
	 КонецЕсли;
 КонецПроцедуры

 
