// @strict-types


Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	Префикс = ПолучательТовара.Префикс;
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Если Накладная Тогда 
		ПроверяемыеРеквизиты.добавить("ВхДата");
		ПроверяемыеРеквизиты.добавить("ВхНомер");
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Движения.Материалы.Записывать	 	= Истина;
	Движения.Рулоны.Записывать 			= Истина;
	Движения.ЦеныМатериалов.Записывать 	= Истина;
	Движения.ЦеныРулонов.Записывать 	= Истина;
	
	//Выгрузим		
	//тНомер = Номер;
	//поискФ = СтрНайти(тНомер,"/");
	//Если поискФ>0 Тогда 
	//	тНомер = СтрЗаменить(Номер,"/","_");
	//КонецЕсли;
	//
	//Если ПолучательТовара.ИНН = "667472326758" Тогда
	//	ИмяФайла = "IP\IP_receipt_"+Формат(Дата,"ДФ='ддММгггг'")+"_"+СокрЛП(тНомер)+".xml"; 			
	//ИначеЕсли ПолучательТовара.ИНН = "6671320017" Тогда 	
	//	ИмяФайла = "RA\RA_receipt_"+Формат(Дата,"ДФ='ддММгггг'")+"_"+СокрЛП(тНомер)+".xml";
	//ИначеЕсли  ПолучательТовара.ИНН = "6679121870" Тогда 
	//	ИмяФайла = "TX\TX_receipt_"+Формат(Дата,"ДФ='ддММгггг'")+"_"+СокрЛП(тНомер)+".xml";
	//КонецЕсли;
	//ПолноеИмяФайла = "C:\Obmen\"+ИмяФайла;	
	//ЗаписьXML = Новый ЗаписьXML;
	//ЗаписьXML.ОткрытьФайл(ПолноеИмяФайла);
	//
	//ЗаписьXML.ЗаписатьОбъявлениеXML();
	//ЗаписьXML.ЗаписатьНачалоЭлемента("Поступления");
	//
	Для каждого стрТЧ из Товары цикл
		Если ЗначениеЗаполнено(стрТЧ.Рулон) Тогда 
			ЗаписьРулоны = Движения.Рулоны.Добавить();
			ЗаписьРулоны.ВидДвижения		= ВидДвиженияНакопления.Приход;
			ЗаписьРулоны.Период     		= Дата;
			ЗаписьРулоны.Количество 		= стрТЧ.Количество;
			ЗаписьРулоны.Материал   		= стрТЧ.Материал; 
			ЗаписьРулоны.МатериалОсновы   	= стрТЧ.МатериалОсновы;
			ЗаписьРулоны.Регистратор		= Ссылка;
			ЗаписьРулоны.Рулон      		= стрТЧ.Рулон;
			
			ЗаписьЦеныРулонов = Движения.ЦеныРулонов.Добавить();
			ЗаписьЦеныРулонов.Период		= Дата;
			ЗаписьЦеныРулонов.Регистратор	= Ссылка;
			ЗаписьЦеныРулонов.Рулон       	= стрТЧ.Рулон;
			ЗаписьЦеныРулонов.Цена       	= стрТЧ.Всего/стрТЧ.Количество;
			
			//(140621
			Если ЗначениеЗаполнено(стрТЧ.Материал) и ЗначениеЗаполнено(стрТЧ.МатериалОсновы) Тогда
				НаборЗаписей = РегистрыСведений.СоотвествиеМатериалаОсновыИМатериалы.СоздатьНаборЗаписей();
				НаборЗаписей.Отбор.Материал.Установить(стрТЧ.Материал);
				НаборЗаписей.Отбор.МатериалОсновы.Установить(стрТЧ.МатериалОсновы);
				НоваяЗапись = НаборЗаписей.Добавить();
				НоваяЗапись.Материал 		= стрТЧ.Материал; 
				НоваяЗапись.МатериалОсновы 	= стрТЧ.МатериалОсновы;
				НаборЗаписей.Записать();
			КонецЕсли;
			//)140621
		иначе
			ЗаписьМатериалы	= Движения.Материалы.Добавить();
			ЗаписьМатериалы.ВидДвижения		= ВидДвиженияНакопления.Приход;
			ЗаписьМатериалы.Период     		= Дата;
			ЗаписьМатериалы.Количество 		= стрТЧ.Количество;
			ЗаписьМатериалы.МатериалОсновы  = стрТЧ.МатериалОсновы;
			ЗаписьМатериалы.Материал   		= стрТЧ.Материал;
			ЗаписьМатериалы.Регистратор		= Ссылка;
			
			ЗаписьЦеныМатериалов 	= Движения.ЦеныМатериалов.Добавить();
			ЗаписьЦеныМатериалов.Период      = Дата;
			ЗаписьЦеныМатериалов.Регистратор = Ссылка;
			ЗаписьЦеныМатериалов.Материал    = стрТЧ.Материал;
			ЗаписьЦеныМатериалов.Цена        = стрТЧ.Всего/стрТЧ.Количество;
		КонецЕсли;
	//	
	//	ЗаписьXML.ЗаписатьНачалоЭлемента("Поступление");	
	//	
	//	ЗаписьXML.ЗаписатьАтрибут("Дата",XMLСтрока(Дата));	
	//	ЗаписьXML.ЗаписатьАтрибут("Номер",XMLСтрока(Номер));
	//	
	//	ЗаписьXML.ЗаписатьАтрибут("Контрагент",Поставщик.Наименование);
	//	ЗаписьXML.ЗаписатьАтрибут("КонтрагентИНН",Поставщик.ИНН);
	//	ЗаписьXML.ЗаписатьАтрибут("КонтрагентКПП",Поставщик.КПП);
	//	ЗаписьXML.ЗаписатьАтрибут("КонтрагентПолное",Поставщик.НаименованиеПолное);
	//	ЗаписьXML.ЗаписатьАтрибут("КонтрагентАдрес",Поставщик.ЮридическийАдрес);
	//	
	//	ЗаписьXML.ЗаписатьАтрибут("ДатаВходящегоДокумента",XMLСтрока(ВхДата));	
	//	ЗаписьXML.ЗаписатьАтрибут("НомерВходящегоДокумента",ВхНомер);
	//	
	//	Если ЗначениеЗаполнено(Поставщик.НомерРасчетногоСчета) Тогда 
	//		ЗаписьXML.ЗаписатьАтрибут("НомерРС",Поставщик.НомерРасчетногоСчета);
	//		ЗаписьXML.ЗаписатьАтрибут("БИК",Поставщик.БИК);
	//		ЗаписьXML.ЗаписатьАтрибут("НаименованиеРС","Расчетный в "+Поставщик.Банк);
	//	иначе
	//		ЗаписьXML.ЗаписатьАтрибут("НомерРС","");
	//		ЗаписьXML.ЗаписатьАтрибут("БИК","");
	//		ЗаписьXML.ЗаписатьАтрибут("НаименованиеРС","");
	//	КонецЕсли;	
	//	
	//	ЗаписьXML.ЗаписатьАтрибут("Договор",Договор.Наименование);		
	//	ЗаписьXML.ЗаписатьАтрибут("ОрганизацияИНН",ПолучательТовара.ИНН);
	//	ЗаписьXML.ЗаписатьАтрибут("ОрганизацияПрефикс",ПолучательТовара.Префикс);
	//	
	//	ЗаписьXML.ЗаписатьАтрибут("ТоварНомерСтроки",Строка(стрТЧ.НомерСтроки));
	//	ЗаписьXML.ЗаписатьАтрибут("Номенклатура",XMLСтрока(стрТЧ.Материал));
	//	ЗаписьXML.ЗаписатьАтрибут("ТоварНоменклатура",стрТЧ.Материал.Наименование);
	//	ЗаписьXML.ЗаписатьАтрибут("ТоварКоличество",Строка(стрТЧ.Количество));
	//	ЗаписьXML.ЗаписатьАтрибут("ТоварЦена",Строка(стрТЧ.Цена));
	//	ЗаписьXML.ЗаписатьАтрибут("ТоварСумма",Строка(стрТЧ.Сумма));
	//	ЗаписьXML.ЗаписатьАтрибут("ТоварСуммаНДС",Строка(стрТЧ.СуммаНДС));
	//	ЗаписьXML.ЗаписатьАтрибут("ТоварНДС",Строка(стрТЧ.НДС));
	//	ЗаписьXML.ЗаписатьАтрибут("ТоварВсего",Строка(стрТЧ.Всего));

	//	ЗаписьXML.ЗаписатьКонецЭлемента();	

	КонецЦикла;
	//
	//ЗаписьXML.ЗаписатьКонецЭлемента();
	//ЗаписьXML.Закрыть();

КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РасходныйКассовыйОрдер") Тогда
		ПолучательТовара= ДанныеЗаполнения.Организация;
		СуммаДокумента 	= ДанныеЗаполнения.СуммаДокумента;
		Для Каждого ТекСтрокаЗаказы Из ДанныеЗаполнения.Заказы Цикл
			НоваяСтрока = Товары.Добавить();
			НоваяСтрока.Количество 		= ТекСтрокаЗаказы.Количество;
			НоваяСтрока.Материал 		= ТекСтрокаЗаказы.Материал;
			НоваяСтрока.МатериалОсновы 	= ТекСтрокаЗаказы.Материал.МатериалОсновы;
			НоваяСтрока.Поставщик       = ТекСтрокаЗаказы.Материал.Поставщик;
			НоваяСтрока.Сумма 			= ТекСтрокаЗаказы.Сумма;
			НоваяСтрока.Цена 			= ?(ТекСтрокаЗаказы.Количество=0,0,ТекСтрокаЗаказы.Сумма/ТекСтрокаЗаказы.Количество);
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

