
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если Не ДанныеЗаполнения=Неопределено Тогда 
		
		ЗаполнитьЗначенияСвойств(ЭтотОбъект,ДанныеЗаполнения,,"Дата,Номер");
		
		ДокументЗатраты = ДанныеЗаполнения;
		
		Заказы.Загрузить(ДанныеЗаполнения.Заказы.Выгрузить());
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Если ЗначениеЗаполнено(ДокументЗатраты) Тогда 
		Если Не ЗначениеЗаполнено(ДокументЗатраты.ДокументОплаты) Тогда 
			ОбДокументЗатраты = ДокументЗатраты.ПолучитьОбъект();
			ОбДокументЗатраты.ДокументОплаты = Ссылка;
			ОбДокументЗатраты.Записать();
		КонецЕсли;	
	КонецЕсли;	
	
	// регистр Касса 
	Движения.Касса.Записывать = Истина;
	Если Заказы.Количество()=0 Тогда 
		Движение 				= Движения.Касса.Добавить();
		Движение.ВидДвижения    = ВидДвиженияНакопления.Расход;
		Движение.Период 		= Дата;
		Движение.Организация 	= Организация;
		Движение.РасчетныйСчет 	= КассаСчет;
		Движение.ВидПлатежа 	= ВидПлатежа;
		Движение.СтавкаНДС      = Контрагент.СтавкаНДС;
		Движение.Месяц 			= Период;
		Если ЗначениеЗаполнено(СтатьяРасходов) Тогда 
			Движение.Статья			= СтатьяРасходов;
		КонецЕсли;
		Если ЗначениеЗаполнено(НомерСтатьиРасхода) Тогда 
			Движение.НомерСтатьи 	= НомерСтатьиРасхода;
		КонецЕсли;
		Движение.Сумма 			= СуммаДокумента;
	иначе	
		для Каждого стр из Заказы цикл
			Движение 				= Движения.Касса.Добавить();
			Движение.ВидДвижения    = ВидДвиженияНакопления.Расход;
			Движение.Период 		= Дата;
			Движение.Организация 	= Организация;
			Движение.РасчетныйСчет 	= КассаСчет;
			Движение.ВидПлатежа 	= ВидПлатежа;
			Движение.СтавкаНДС      = Контрагент.СтавкаНДС;
			Движение.Месяц 			= Период;
			Движение.Статья			= стр.СтатьяРасходов;
			Движение.НомерСтатьи 	= стр.НомерСтатьиРасхода;
			Если ЗначениеЗаполнено(стр.КодЗаказа) Тогда 
				Движение.КодЗаказа      = стр.КодЗаказа;
			иначе
				Если ЗначениеЗаполнено(стр.Заявка) Тогда 
					Движение.КодЗаказа  = стр.Заявка.Номер;
				КонецЕсли;	
			КонецЕсли;
			Движение.Сумма 			= стр.Сумма;
		КонецЦикла;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДокументЗатраты) Тогда 
		Движения.ПланируемыеПрочиеЗатраты.Записывать = Истина;
		Для Каждого стр из Заказы цикл
			Движение 				= Движения.ПланируемыеПрочиеЗатраты.Добавить();
			Движение.ВидДвижения    = ВидДвиженияНакопления.Расход;
			Движение.Период 		= Дата;
			Движение.ВидПлатежа     = ВидПлатежа;
			Движение.КодЗаказа      = стр.Заявка.Номер;
			Движение.Месяц          = Период;
			Движение.НомерСтатьи    = НомерСтатьиРасхода;
			Движение.Организация 	= Организация;
			Движение.РасчетныйСчет  = КассаСчет;
			Движение.СтавкаНДС      = Контрагент.СтавкаНДС;
			Движение.Статья         = СтатьяРасходов;
			Движение.Сумма 			= стр.Сумма;
		КонецЦикла;
	КонецЕсли;

	
КонецПроцедуры
