
Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	Префикс = Организация.Префикс;
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Счет") Тогда
		Договор 	= ДанныеЗаполнения.Договор;
		Контрагент 	= ДанныеЗаполнения.Контрагент;
		Организация = ДанныеЗаполнения.Организация;
		Отвественный= ДанныеЗаполнения.Отвественный;
		Основание 	= ДанныеЗаполнения.Ссылка;
		Для Каждого ТекСтрокаТовары Из ДанныеЗаполнения.Товары Цикл
			НоваяСтрока 			= Товары.Добавить();
			НоваяСтрока.Всего 		= ТекСтрокаТовары.Всего;
			НоваяСтрока.КодЗаказа 	= ТекСтрокаТовары.КодЗаказа.Номер;
			НоваяСтрока.Количество 	= ТекСтрокаТовары.Количество;
			НоваяСтрока.НДС 		= ТекСтрокаТовары.НДС;
			НоваяСтрока.Номенклатура= ТекСтрокаТовары.Номенклатура;
			НоваяСтрока.Сумма 		= ТекСтрокаТовары.Сумма;
			НоваяСтрока.СуммаНДС 	= ТекСтрокаТовары.СуммаНДС;
			НоваяСтрока.Цена 		= ТекСтрокаТовары.Цена;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.ВзаиморасчетыПоАктам.Записывать = Истина;
	
	//Выгрузим		
	тНомер = Номер;
	поискФ = СтрНайти(тНомер,"/");
	Если поискФ>0 Тогда 
		тНомер = СтрЗаменить(Номер,"/","_");
	КонецЕсли;
	
	//Если Организация.ИНН = "667472326758" Тогда
	//	ИмяФайла = "IP\IP_act_"+Формат(Дата,"ДФ='ддММгггг'")+"_"+СокрЛП(тНомер)+".xml"; 			
	//ИначеЕсли Организация.ИНН = "6671320017" Тогда 	
	//	ИмяФайла = "RA\RA_act_"+Формат(Дата,"ДФ='ддММгггг'")+"_"+СокрЛП(тНомер)+".xml";
	//ИначеЕсли  Организация.ИНН = "6679121870" Тогда 
	//	ИмяФайла = "TX\TX_act_"+Формат(Дата,"ДФ='ддММгггг'")+"_"+СокрЛП(тНомер)+".xml";
	//КонецЕсли;
	//ПолноеИмяФайла = "C:\Obmen\"+ИмяФайла;	
	//ЗаписьXML = Новый ЗаписьXML;
	//ЗаписьXML.ОткрытьФайл(ПолноеИмяФайла);
	//
	//ЗаписьXML.ЗаписатьОбъявлениеXML();
	//ЗаписьXML.ЗаписатьНачалоЭлемента("Акты");
	
	Для Каждого стрТЧ из Товары цикл	
		
		текЗаказ = Неопределено;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Заявка.Ссылка
		|ИЗ
		|	Документ.Заявка КАК Заявка
		|ГДЕ
		|	Заявка.Номер = &КодЗаказа";
		
		Запрос.УстановитьПараметр("КодЗаказа", стрТЧ.КодЗаказа);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			текЗаказ = ВыборкаДетальныеЗаписи.Ссылка;
		КонецЦикла;
		
		НаборЗаказ = РегистрыСведений.Заказы.СоздатьНаборЗаписей();
		НаборЗаказ.Отбор.Регистратор.Установить(текЗаказ);
		НаборЗаказ.Прочитать();
		Попытка
			текЗапись = НаборЗаказ.Получить(0);
			текЗапись.ДатаВозвратаАкта 	= ДатаВозвратаВБухгалтерию;
			текЗапись.Акт 				= Ссылка;
			НаборЗаказ.Записать();
		Исключение
		КонецПопытки;
		
		записьВзаиморасчеты = Движения.ВзаиморасчетыПоАктам.Добавить();
		записьВзаиморасчеты.ВидДвижения = ВидДвиженияНакопления.Приход;
		записьВзаиморасчеты.Период      = Ссылка.Дата;
		записьВзаиморасчеты.Регистратор = Ссылка;
		записьВзаиморасчеты.Организация = Ссылка.Организация;
		записьВзаиморасчеты.Контрагент	= Ссылка.Контрагент;
		записьВзаиморасчеты.КодЗаказа 	= Ссылка.Номер;
		записьВзаиморасчеты.Сумма     	= Ссылка.СуммаДокумента;
		
		Движения.Записать();			
		
		//ЗаписьXML.ЗаписатьНачалоЭлемента("Акт");	
		//
		//ЗаписьXML.ЗаписатьАтрибут("Дата",XMLСтрока(Дата));	
		//ЗаписьXML.ЗаписатьАтрибут("Номер",XMLСтрока(Номер));
		//
		//ЗаписьXML.ЗаписатьАтрибут("Контрагент",Контрагент.Наименование);
		//ЗаписьXML.ЗаписатьАтрибут("КонтрагентИНН",Контрагент.ИНН);
		//ЗаписьXML.ЗаписатьАтрибут("КонтрагентКПП",Контрагент.КПП);
		//ЗаписьXML.ЗаписатьАтрибут("КонтрагентПолное",Контрагент.НаименованиеПолное);
		//ЗаписьXML.ЗаписатьАтрибут("КонтрагентАдрес",Контрагент.ЮридическийАдрес);
		//
		//Если ЗначениеЗаполнено(Контрагент.НомерРасчетногоСчета) Тогда 
		//	ЗаписьXML.ЗаписатьАтрибут("НомерРС",Контрагент.НомерРасчетногоСчета);
		//	ЗаписьXML.ЗаписатьАтрибут("БИК",Контрагент.БИК);
		//	ЗаписьXML.ЗаписатьАтрибут("НаименованиеРС","Расчетный в "+Контрагент.Банк);
		//иначе
		//	ЗаписьXML.ЗаписатьАтрибут("НомерРС","");
		//	ЗаписьXML.ЗаписатьАтрибут("БИК","");
		//	ЗаписьXML.ЗаписатьАтрибут("НаименованиеРС","");
		//КонецЕсли;	
		//
		//ЗаписьXML.ЗаписатьАтрибут("Договор",Договор.Наименование);		
		//ЗаписьXML.ЗаписатьАтрибут("ОрганизацияИНН",Организация.ИНН);
		//ЗаписьXML.ЗаписатьАтрибут("ОрганизацияПрефикс",Организация.Префикс);
		//ЗаписьXML.ЗаписатьАтрибут("Ответственный",Отвественный.Наименование);
		//
		//ЗаписьXML.ЗаписатьАтрибут("ОснованиеНомер",Основание.Номер);
		//ЗаписьXML.ЗаписатьАтрибут("ОснованиеДата",XMLСтрока(Основание.Дата));
		//
		//ЗаписьXML.ЗаписатьАтрибут("ТоварНомерСтроки",Строка(стрТЧ.НомерСтроки));
		//ЗаписьXML.ЗаписатьАтрибут("Номенклатура",XMLСтрока(стрТЧ.Номенклатура));
		//ЗаписьXML.ЗаписатьАтрибут("ТоварНоменклатура",стрТЧ.Номенклатура.Наименование);
		//ЗаписьXML.ЗаписатьАтрибут("ТоварКоличество",Строка(стрТЧ.Количество));
		//ЗаписьXML.ЗаписатьАтрибут("ТоварЦена",Строка(стрТЧ.Цена));
		//ЗаписьXML.ЗаписатьАтрибут("ТоварСумма",Строка(стрТЧ.Сумма));
		//ЗаписьXML.ЗаписатьАтрибут("ТоварСуммаНДС",Строка(стрТЧ.СуммаНДС));
		//ЗаписьXML.ЗаписатьАтрибут("ТоварНДС",Строка(стрТЧ.НДС));
		//ЗаписьXML.ЗаписатьАтрибут("ТоварВсего",Строка(стрТЧ.Всего));
		//
		//Попытка
		//	ЗаписьXML.ЗаписатьАтрибут("ТоварКодЗаказа",стрТЧ.КодЗаказа.Номер);
		//Исключение
		//	ЗаписьXML.ЗаписатьАтрибут("ТоварКодЗаказа","");
		//КонецПопытки;
		//
		//ЗаписьXML.ЗаписатьКонецЭлемента();	
	КонецЦикла;
	
	//ЗаписьXML.ЗаписатьКонецЭлемента();
	//ЗаписьXML.Закрыть();
	
КонецПроцедуры

