
Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	Префикс = Организация.Префикс;
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Счет") Тогда
		Договор 	= ДанныеЗаполнения.Договор;
		Контрагент 	= ДанныеЗаполнения.Контрагент;
		Организация = ДанныеЗаполнения.Организация;
		Отвественный= ДанныеЗаполнения.Отвественный;
		Основание 	= ДанныеЗаполнения.Ссылка;
		Для Каждого ТекСтрокаТовары Из ДанныеЗаполнения.Товары Цикл
			НоваяСтрока 			= Товары.Добавить();
			НоваяСтрока.Всего 		= ТекСтрокаТовары.Всего;
			НоваяСтрока.КодЗаказа 	= ТекСтрокаТовары.КодЗаказа.Номер;
			НоваяСтрока.Количество 	= ТекСтрокаТовары.Количество;
			НоваяСтрока.НДС 		= ТекСтрокаТовары.НДС;
			НоваяСтрока.Номенклатура= ТекСтрокаТовары.Номенклатура;
			НоваяСтрока.Сумма 		= ТекСтрокаТовары.Сумма;
			НоваяСтрока.СуммаНДС 	= ТекСтрокаТовары.СуммаНДС;
			НоваяСтрока.Цена 		= ТекСтрокаТовары.Цена;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.ВзаиморасчетыПоАктам.Записывать = Истина;
			
	тНомер = Номер;
	поискФ = СтрНайти(тНомер,"/");
	Если поискФ>0 Тогда 
		тНомер = СтрЗаменить(Номер,"/","_");
	КонецЕсли;
	
	Для Каждого стрТЧ из Товары цикл	
		
		текЗаказ = Неопределено;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Заявка.Ссылка
		|ИЗ
		|	Документ.Заявка КАК Заявка
		|ГДЕ
		|	Заявка.Номер = &КодЗаказа";
		
		Запрос.УстановитьПараметр("КодЗаказа", стрТЧ.КодЗаказа);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			текЗаказ = ВыборкаДетальныеЗаписи.Ссылка;
		КонецЦикла;
		
		НаборЗаказ = РегистрыСведений.Заказы.СоздатьНаборЗаписей();
		НаборЗаказ.Отбор.Регистратор.Установить(текЗаказ);
		НаборЗаказ.Прочитать();
		Попытка
			текЗапись = НаборЗаказ.Получить(0);
			текЗапись.ДатаВозвратаАкта 	= ДатаВозвратаВБухгалтерию;
			текЗапись.Акт 				= Ссылка;
			НаборЗаказ.Записать();
		Исключение
		КонецПопытки;
		
		записьВзаиморасчеты = Движения.ВзаиморасчетыПоАктам.Добавить();
		записьВзаиморасчеты.ВидДвижения = ВидДвиженияНакопления.Приход;
		записьВзаиморасчеты.Период      = Ссылка.Дата;
		записьВзаиморасчеты.Регистратор = Ссылка;
		записьВзаиморасчеты.Организация = Ссылка.Организация;
		записьВзаиморасчеты.Контрагент	= Ссылка.Контрагент;
		записьВзаиморасчеты.КодЗаказа 	= Ссылка.Номер;
		записьВзаиморасчеты.Сумма     	= Ссылка.СуммаДокумента;
		
		Движения.Записать();			
		
	КонецЦикла;
	
КонецПроцедуры

