
Процедура Печать(ТабДок, ПараметрКоманды) Экспорт 
	
	табСотрудников = ПараметрКоманды.Начислено.Выгрузить();
	табСотрудников.Свернуть("Сотрудник,Должность","СуммаНачислено");
	
	ЕстьШП = Ложь;
	ЕстьТО = Ложь;
	
	Для Каждого стрТаб из табСотрудников Цикл 
		
		Макет = ПолучитьМакет("Макет");
		
		ЗапросНаправление = Новый Запрос;
		ЗапросНаправление.Текст = 
		"ВЫБРАТЬ
		|	НачислениеЗарплатыНачислено.Сотрудник
		|ИЗ
		|	Документ.НачислениеЗарплаты.Начислено КАК НачислениеЗарплатыНачислено
		|ГДЕ
		|	НачислениеЗарплатыНачислено.НачислениеУдержание.Направление = &Направление
		|	И НачислениеЗарплатыНачислено.Сотрудник = &Сотрудник
		|	И НачислениеЗарплатыНачислено.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	НачислениеЗарплатыНачислено.Сотрудник";
		
		ЗапросНаправление.УстановитьПараметр("Направление", Справочники.Направления.НайтиПоНаименованию("ШП"));	
		ЗапросНаправление.УстановитьПараметр("Сотрудник", стрТаб.Сотрудник);
		ЗапросНаправление.УстановитьПараметр("Ссылка", ПараметрКоманды.Ссылка);
		
		РезультатНаправление = ЗапросНаправление.Выполнить();	
		ВыборкаНаправление = РезультатНаправление.Выбрать();	
		Пока ВыборкаНаправление.Следующий() Цикл
			ЕстьШП = Истина;
		КонецЦикла;
		
		Если ЕстьШП Тогда //ШП
			
			ОбластьМакета	= Макет.ПолучитьОбласть("Шапка");
			ОбластьМакета.Параметры.Период 		= ПараметрКоманды.ПериодНачисления; 
			ФИО = стрТаб.Сотрудник.Фамилия+" "+стрТаб.Сотрудник.Имя+" "+стрТаб.Сотрудник.Отчество;
			ОбластьМакета.Параметры.Сотрудник 	= ФИО;
			ОбластьМакета.Параметры.Должность 	= стрТаб.Должность;
			ОбластьМакета.Параметры.Направление 	= "ШП";		
			ТабДок.Вывести(ОбластьМакета);
			
			сч=1;
			Отбор = Новый Структура;
			Отбор.Вставить("Сотрудник",стрТаб.Сотрудник);
			Строки = ПараметрКоманды.Начислено.НайтиСтроки(Отбор);
			
			ВсегоНачислено = 0;
			для Каждого стрТЧ из Строки цикл
				Если стрТЧ.НачислениеУдержание.НачислениеУдержание = Перечисления.НачисленияУдержания.Начисление Тогда 
					Если стрТЧ.НачислениеУдержание.Направление = Справочники.Направления.НайтиПоНаименованию("ШП") Тогда 
						ВсегоНачислено = ВсегоНачислено+стрТЧ.СуммаНачислено;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
			
			ОбластьМакета	= Макет.ПолучитьОбласть("Итого");
			ОбластьМакета.параметры.Дата 		= ПараметрКоманды.дата; 
			ОбластьМакета.параметры.Назначение 	= "Начислено всего, в т.ч.";
			ОбластьМакета.параметры.Сумма	 	= ВсегоНачислено;
			ТабДок.Вывести(ОбластьМакета);
			
			ОблМакетаНач	= Макет.ПолучитьОбласть("Начисление");		
			для Каждого стрТЧ из Строки цикл
				Если стрТЧ.НачислениеУдержание.НачислениеУдержание = Перечисления.НачисленияУдержания.Начисление Тогда 
					Если стрТЧ.НачислениеУдержание.Направление = Справочники.Направления.НайтиПоНаименованию("ШП") Тогда 
						ОблМакетаНач.параметры.пп = Сч;
						ОблМакетаНач.параметры.Назначение 	= стрТЧ.НачислениеУдержание;
						ОблМакетаНач.параметры.Сумма	 	= стрТЧ.СуммаНачислено;	
						ОблМакетаНач.параметры.Период       = ПараметрКоманды.ПериодНачисления;
						ТабДок.Вывести(ОблМакетаНач);
						сч=сч+1;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
						
			ОблМакета	= Макет.ПолучитьОбласть("Область1");
			ТабДок.Вывести(ОблМакета);
			
			ОблМакетаВып	= Макет.ПолучитьОбласть("Вычет");
			ВсегоУдержано = 0;
			сч=1;
			для Каждого стрТЧ из Строки цикл
				Если стрТЧ.НачислениеУдержание.НачислениеУдержание = Перечисления.НачисленияУдержания.Удержание Тогда 
					Если стрТЧ.НачислениеУдержание.Направление = Справочники.Направления.НайтиПоНаименованию("ШП") Тогда 
						ОблМакетаВып.параметры.пп 			= Сч;
						ОблМакетаВып.параметры.Дата		 	= ПараметрКоманды.дата;
						ОблМакетаВып.параметры.Назначение 	= стрТЧ.НачислениеУдержание;
						ОблМакетаВып.параметры.Сумма	 	= -стрТЧ.СуммаНачислено;
						ОблМакетаВып.параметры.Период       = ПараметрКоманды.ПериодНачисления;
						ОблМакетаВып.параметры.Форма	 	= "нал";
						ТабДок.Вывести(ОблМакетаВып);
						ВсегоУдержано = ВсегоУдержано + стрТЧ.СуммаНачислено;
						сч=сч+1;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
			
			Контр = Справочники.Контрагенты.НайтиПоНаименованию(стрТаб.Сотрудник);
			
			Если ЗначениеЗаполнено(Контр) Тогда 
				
				//Найдем авансы по ЗП
				Запрос = Новый Запрос;
				Запрос.Текст =
				"ВЫБРАТЬ
				|	КассаОбороты.Регистратор,
				|	КассаОбороты.СуммаОборот,
				|	КассаОбороты.Регистратор.НаименованиеРасхода,
				|	КассаОбороты.Регистратор.Период,
				|	КассаОбороты.Регистратор.ВидПлатежаФакт,
				|	КассаОбороты.Направление
				|ИЗ
				|	РегистрНакопления.Касса.Обороты(
				|			,
				|			&КонПериода,
				|			Регистратор,
				|			Месяц = &Период
				|				И (НомерСтатьи = ""24.1""
				|					ИЛИ НомерСтатьи = ""24.2"")
				|				И Направление = &Направление) КАК КассаОбороты
				|ГДЕ
				|	КассаОбороты.Регистратор.Контрагент = &Контрагент
				|
				|УПОРЯДОЧИТЬ ПО
				|	КассаОбороты.Регистратор.Дата";
				
				Запрос.УстановитьПараметр("Период",ПараметрКоманды.ПериодНачисления);
				Запрос.УстановитьПараметр("Контрагент",Контр);
				Запрос.УстановитьПараметр("КонПериода",ПараметрКоманды.дата);
				Запрос.УстановитьПараметр("Направление",Справочники.Направления.НайтиПоНаименованию("ШП"));
				
				Выборка = Запрос.Выполнить().Выбрать();
				Пока Выборка.Следующий() цикл
					ОблМакетаВып.параметры.пп 			= Сч;
					ОблМакетаВып.параметры.Дата		 	= Выборка.Регистратор.дата;
					ОблМакетаВып.параметры.Назначение 	= Выборка.РегистраторНаименованиеРасхода;
					ОблМакетаВып.параметры.Сумма	 	= -Выборка.СуммаОборот;	
					ОблМакетаВып.параметры.Форма	 	= Выборка.РегистраторВидПлатежаФакт;
					ОблМакетаВып.параметры.Период       = Выборка.РегистраторПериод;
					ТабДок.Вывести(ОблМакетаВып);
					ВсегоУдержано = ВсегоУдержано + Выборка.СуммаОборот;
					сч=сч+1;
				КонецЦикла;
			иначе
				Сообщить("Контрогент = Сотруднику: "+стрТаб.Сотрудник+" не найден в РКО");
			КонецЕсли;
			
			ОбластьМакета	= Макет.ПолучитьОбласть("Итого");
			ОбластьМакета.параметры.Дата 		= ПараметрКоманды.дата; 
			ОбластьМакета.параметры.Назначение 	= "Всего, к выплате: ";
			//Если ВсегоНачислено<0 Тогда
			//	ВсегоНачислено = - ВсегоНачислено;
			//КонецЕсли;	
			ОбластьМакета.параметры.Сумма	 	= ВсегоНачислено+ВсегоУдержано;
			ТабДок.Вывести(ОбластьМакета);
		КонецЕсли;
		
		ЗапросНаправление.УстановитьПараметр("Направление", Справочники.Направления.НайтиПоНаименованию("ТО"));
		ЗапросНаправление.УстановитьПараметр("Сотрудник", стрТаб.Сотрудник);
		ЗапросНаправление.УстановитьПараметр("Ссылка", ПараметрКоманды.Ссылка);
		
		РезультатНаправление = ЗапросНаправление.Выполнить();	
		ВыборкаНаправление = РезультатНаправление.Выбрать();	
		Пока ВыборкаНаправление.Следующий() Цикл
			ЕстьТО = Истина;
		КонецЦикла;	
		
		Если ЕстьТО Тогда //ТО
			ОбластьМакета	= Макет.ПолучитьОбласть("Шапка");
			ОбластьМакета.Параметры.Период 		= ПараметрКоманды.ПериодНачисления; 
			ФИО = стрТаб.Сотрудник.Фамилия+" "+стрТаб.Сотрудник.Имя+" "+стрТаб.Сотрудник.Отчество;
			ОбластьМакета.Параметры.Сотрудник 	= ФИО;
			ОбластьМакета.Параметры.Должность 	= стрТаб.Должность;
			ОбластьМакета.Параметры.Направление = "ТО";		
			ТабДок.Вывести(ОбластьМакета);
			
			сч=1;
			Отбор = Новый Структура;
			Отбор.Вставить("Сотрудник",стрТаб.Сотрудник);
			Строки = ПараметрКоманды.Начислено.НайтиСтроки(Отбор);
			
			ВсегоНачислено = 0;
			для Каждого стрТЧ из Строки цикл
				Если стрТЧ.НачислениеУдержание.НачислениеУдержание = Перечисления.НачисленияУдержания.Начисление Тогда 
				//Если стрТЧ.НачислениеУдержание.НачислениеУдержание = Перечисления.НачисленияУдержания.Начисление Тогда 
					Если стрТЧ.НачислениеУдержание.Направление = Справочники.Направления.НайтиПоНаименованию("ТО") Тогда 
						ВсегоНачислено = ВсегоНачислено+стрТЧ.СуммаНачислено;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
			
			ОбластьМакета	= Макет.ПолучитьОбласть("Итого");
			ОбластьМакета.параметры.Дата 		= ПараметрКоманды.дата; 
			ОбластьМакета.параметры.Назначение 	= "Начислено всего, в т.ч.";
			ОбластьМакета.параметры.Сумма	 	= ВсегоНачислено;
			ТабДок.Вывести(ОбластьМакета);
			
			ОблМакетаНач	= Макет.ПолучитьОбласть("Начисление");		
			для Каждого стрТЧ из Строки цикл
				Если стрТЧ.НачислениеУдержание.НачислениеУдержание = Перечисления.НачисленияУдержания.Начисление Тогда 
					Если стрТЧ.НачислениеУдержание.Направление = Справочники.Направления.НайтиПоНаименованию("ТО") Тогда 
						ОблМакетаНач.параметры.пп = Сч;
						ОблМакетаНач.параметры.Назначение 	= стрТЧ.НачислениеУдержание;
						ОблМакетаНач.параметры.Сумма	 	= стрТЧ.СуммаНачислено;	
						ОблМакетаНач.параметры.Период       = ПараметрКоманды.ПериодНачисления;
						ТабДок.Вывести(ОблМакетаНач);
						сч=сч+1;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
						
			ОблМакета	= Макет.ПолучитьОбласть("Область1");
			ТабДок.Вывести(ОблМакета);
			
			ОблМакетаВып	= Макет.ПолучитьОбласть("Вычет");
			ВсегоУдержано = 0;
			сч=1;
			для Каждого стрТЧ из Строки цикл
				Если стрТЧ.НачислениеУдержание.НачислениеУдержание = Перечисления.НачисленияУдержания.Удержание Тогда 
					Если стрТЧ.НачислениеУдержание.Направление = Справочники.Направления.НайтиПоНаименованию("ТО") Тогда 
						ОблМакетаВып.параметры.пп 			= Сч;
						ОблМакетаВып.параметры.Дата		 	= ПараметрКоманды.дата;
						ОблМакетаВып.параметры.Назначение 	= стрТЧ.НачислениеУдержание;
						ОблМакетаВып.параметры.Сумма	 	= -стрТЧ.СуммаНачислено;
						ОблМакетаВып.параметры.Период       = ПараметрКоманды.ПериодНачисления;
						ОблМакетаВып.параметры.Форма	 	= "нал";
						ТабДок.Вывести(ОблМакетаВып);
						ВсегоУдержано = ВсегоУдержано + стрТЧ.СуммаНачислено;
						сч=сч+1;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
			
			Контр = Справочники.Контрагенты.НайтиПоНаименованию(стрТаб.Сотрудник);
			
			Если ЗначениеЗаполнено(Контр) Тогда 
				
				//Найдем авансы по ЗП
				Запрос = Новый Запрос;
				Запрос.Текст =
				"ВЫБРАТЬ
				|	КассаОбороты.Регистратор,
				|	КассаОбороты.СуммаОборот,
				|	КассаОбороты.Регистратор.НаименованиеРасхода,
				|	КассаОбороты.Регистратор.Период,
				|	КассаОбороты.Регистратор.ВидПлатежаФакт,
				|	КассаОбороты.Направление
				|ИЗ
				|	РегистрНакопления.Касса.Обороты(
				|			,
				|			&КонПериода,
				|			Регистратор,
				|			Месяц = &Период
				|				И (НомерСтатьи = ""24.1""
				|					ИЛИ НомерСтатьи = ""24.2"")
				|				И Направление = &Направление) КАК КассаОбороты
				|ГДЕ
				|	КассаОбороты.Регистратор.Контрагент = &Контрагент
				|
				|УПОРЯДОЧИТЬ ПО
				|	КассаОбороты.Регистратор.Дата";
				
				Запрос.УстановитьПараметр("Период",ПараметрКоманды.ПериодНачисления);
				Запрос.УстановитьПараметр("Контрагент",Контр);
				Запрос.УстановитьПараметр("КонПериода",ПараметрКоманды.дата);
				Запрос.УстановитьПараметр("Направление",Справочники.Направления.НайтиПоНаименованию("ТО"));
				
				Выборка = Запрос.Выполнить().Выбрать();
				Пока Выборка.Следующий() цикл
					ОблМакетаВып.параметры.пп 			= Сч;
					ОблМакетаВып.параметры.Дата		 	= Выборка.Регистратор.дата;
					ОблМакетаВып.параметры.Назначение 	= Выборка.РегистраторНаименованиеРасхода;
					ОблМакетаВып.параметры.Сумма	 	= -Выборка.СуммаОборот;	
					ОблМакетаВып.параметры.Форма	 	= Выборка.РегистраторВидПлатежаФакт;
					ОблМакетаВып.параметры.Период       = Выборка.РегистраторПериод;
					ТабДок.Вывести(ОблМакетаВып);
					ВсегоУдержано = ВсегоУдержано + Выборка.СуммаОборот;
					сч=сч+1;
				КонецЦикла;
			иначе
				Сообщить("Контрогент = Сотруднику: "+стрТаб.Сотрудник+" не найден в РКО");
			КонецЕсли;
			
			ОбластьМакета	= Макет.ПолучитьОбласть("Итого");
			ОбластьМакета.параметры.Дата 		= ПараметрКоманды.дата; 
			ОбластьМакета.параметры.Назначение 	= "Всего, к выплате: ";
			ОбластьМакета.параметры.Сумма	 	= ВсегоНачислено+ВсегоУдержано;
			ТабДок.Вывести(ОбластьМакета);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры	
