&НаКлиенте
Процедура Расчитать()
	Элементы.Товары.ТекущиеДанные.Сумма = Элементы.Товары.ТекущиеДанные.Цена*Элементы.Товары.ТекущиеДанные.Количество;
	Если Строка(Элементы.Товары.ТекущиеДанные.НДС) = "Без НДС" Тогда
		Элементы.Товары.ТекущиеДанные.СуммаНДС = 0;
	иначеЕсли Строка(Элементы.Товары.ТекущиеДанные.НДС) = "18%" Тогда
		Элементы.Товары.ТекущиеДанные.СуммаНДС = Элементы.Товары.ТекущиеДанные.Сумма*0.18;
	иначеЕсли Строка(Элементы.Товары.ТекущиеДанные.НДС) = "20%" Тогда
		Элементы.Товары.ТекущиеДанные.СуммаНДС = Элементы.Товары.ТекущиеДанные.Сумма*0.2;		
	КонецЕсли;
	Если Объект.НДС_В_томЧисле Тогда
		Элементы.Товары.ТекущиеДанные.Всего	= Элементы.Товары.ТекущиеДанные.Сумма;
	иначе	
		Элементы.Товары.ТекущиеДанные.Всего	= Элементы.Товары.ТекущиеДанные.Сумма+Элементы.Товары.ТекущиеДанные.СуммаНДС;
	КонецЕсли;
	Объект.СуммаДокумента 	= Объект.Товары.Итог("Всего");
КонецПроцедуры

&НаКлиенте
Процедура МатериалыКоличествоПриИзменении(Элемент)
	Расчитать();
КонецПроцедуры

&НаКлиенте
Процедура МатериалыЦенаПриИзменении(Элемент)
	Расчитать();
КонецПроцедуры

&НаКлиенте
Процедура МатериалыСтавкаНДСПриИзменении(Элемент)
	Расчитать();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыМатериалПриИзменении(Элемент)
	ТекДанные = Элементы.Товары.ТекущиеДанные;
	ТекДанные.МатериалОсновы= ПолучитьМатериалОсновы(ТекДанные.Материал);
	ТекДанные.Поставщик 	= ПолучитьПоставщика(ТекДанные.Материал);
КонецПроцедуры

&НаСервере
Функция ПолучитьМатериалОсновы(Материал)
	  Возврат Материал.МатериалОсновы;
 КонецФункции
  
  &НаСервере
Функция ПолучитьПоставщика(Материал)
	  Возврат Материал.Поставщик;
  КонецФункции

&НаКлиенте
Процедура ПрисвоитьНомераРулонам(Команда)
	ПрисвоитьНомераРулонамНаСервере();
	Модифицированность = Истина;
КонецПроцедуры

&НаСервере
Функция ПолучитьНомерПоследнегоРулона()
	
	последНомер =0;

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НомерГода",Прав(Год(Объект.Дата),2)+"%");
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Рулоны.Рулон КАК Рулон
		|ИЗ
		|	РегистрНакопления.Рулоны КАК Рулоны
		|ГДЕ
		|	Рулоны.Рулон ПОДОБНО &НомерГода
		|
		|УПОРЯДОЧИТЬ ПО
		|	Рулон УБЫВ";

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		последНомер = Число(Прав((ВыборкаДетальныеЗаписи.Рулон),4));
	КонецЦикла;
	
	последНомер = СтрЗаменить(последНомер,Символы.НПП,"");
	 
	 Возврат последНомер;
	 
КонецФункции	

&НаСервере
Процедура ПрисвоитьНомераРулонамНаСервере();
	последНомер = Число(ПолучитьНомерПоследнегоРулона());
	текГод 		= Прав(Строка(Год(Объект.Дата)),2);
	для каждого стрТЧ из Объект.Товары цикл
			Если Не ЗначениеЗаполнено(стрТЧ.Рулон) Тогда 
				Если последНомер=0 Тогда 
					стрТЧ.Рулон = текГод+"-0001";
					последНомер = 1;
				иначе
					последНомер = последНомер+1;
					кол = СтрДлина(последНомер);
					стрТЧ.Рулон = текГод+"-";
					кол = 4-кол;
					Если кол>0 Тогда 
						для к=1 по кол цикл
							стрТЧ.Рулон = стрТЧ.Рулон+"0";
						КонецЦикла;	
					КонецЕсли;
					стрТЧ.Рулон = стрТЧ.Рулон+последНомер;
				КонецЕсли;
			КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если  Не Объект.СуммаДокумента = Объект.Товары.Итог("Всего") Тогда 
		Объект.СуммаДокумента = Объект.Товары.Итог("Всего");
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(Объект.Статус) Тогда
		Если Объект.Статус = Перечисления.Статусы.Закрыт И Не РольДоступна("УУ") Тогда 
			ЭтаФорма.ТолькоПросмотр = Истина;
		иначе
			ЭтаФорма.ТолькоПросмотр = Ложь;
		КонецЕсли;	
	иначе	
		Объект.Статус 		= Перечисления.Статусы.Вработе;
		Модифицированность 	= Истина;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьМатериалОсновы(Команда) //130820
	Для Каждого стрТч из Объект.Товары Цикл 
		 стрТч.МатериалОсновы = ПолучитьМатериалОсновы(стрТч.Материал);
	 КонецЦикла;	
	 Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПослеУдаления(Элемент) //241021
	Расчитать();
КонецПроцедуры

	